Test Plan Java.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan Java" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;string1&quot;: &quot;test&quot;,&#xd;
    &quot;string2&quot;: &quot;test&quot;,&#xd;
    &quot;string3&quot;: &quot;test&quot;,&#xd;
    &quot;string4&quot;: &quot;test&quot;,&#xd;
    &quot;string5&quot;: &quot;test&quot;,&#xd;
    &quot;string6&quot;: &quot;test&quot;,&#xd;
    &quot;string7&quot;: &quot;test&quot;,&#xd;
    &quot;string8&quot;: &quot;test&quot;,&#xd;
    &quot;string9&quot;: &quot;test&quot;,&#xd;
    &quot;string10&quot;: &quot;test&quot;,&#xd;
    &quot;string11&quot;: &quot;test&quot;,&#xd;
    &quot;string12&quot;: &quot;test&quot;,&#xd;
    &quot;string13&quot;: &quot;test&quot;,&#xd;
    &quot;string14&quot;: &quot;test&quot;,&#xd;
    &quot;string15&quot;: &quot;test&quot;,&#xd;
    &quot;string16&quot;: &quot;test&quot;,&#xd;
    &quot;string17&quot;: &quot;test&quot;,&#xd;
    &quot;string18&quot;: &quot;test&quot;,&#xd;
    &quot;string19&quot;: &quot;test&quot;,&#xd;
    &quot;string20&quot;: &quot;test&quot;,&#xd;
    &quot;int1&quot;: 10,&#xd;
    &quot;int2&quot;: 10,&#xd;
    &quot;int3&quot;: 10,&#xd;
    &quot;int4&quot;: 10,&#xd;
    &quot;int5&quot;: 10,&#xd;
    &quot;int6&quot;: 10,&#xd;
    &quot;int7&quot;: 10,&#xd;
    &quot;int8&quot;: 10,&#xd;
    &quot;int9&quot;: 10,&#xd;
    &quot;int10&quot;: 10,&#xd;
    &quot;int11&quot;: 10,&#xd;
    &quot;int12&quot;: 10,&#xd;
    &quot;int13&quot;: 10,&#xd;
    &quot;int14&quot;: 10,&#xd;
    &quot;int15&quot;: 10,&#xd;
    &quot;int16&quot;: 10,&#xd;
    &quot;int17&quot;: 10,&#xd;
    &quot;int18&quot;: 10,&#xd;
    &quot;int19&quot;: 10,&#xd;
    &quot;int20&quot;: 10,&#xd;
    &quot;boolean1&quot;: true,&#xd;
    &quot;boolean2&quot;: false,&#xd;
    &quot;boolean3&quot;: true,&#xd;
    &quot;boolean4&quot;: false,&#xd;
    &quot;boolean5&quot;: true,&#xd;
    &quot;boolean6&quot;: false,&#xd;
    &quot;boolean7&quot;: true,&#xd;
    &quot;boolean8&quot;: false,&#xd;
    &quot;boolean9&quot;: true,&#xd;
    &quot;boolean10&quot;: false,&#xd;
    &quot;boolean11&quot;: true,&#xd;
    &quot;boolean12&quot;: false,&#xd;
    &quot;boolean13&quot;: true,&#xd;
    &quot;boolean14&quot;: false,&#xd;
    &quot;boolean15&quot;: true,&#xd;
    &quot;boolean16&quot;: false,&#xd;
    &quot;boolean17&quot;: true,&#xd;
    &quot;boolean18&quot;: false,&#xd;
    &quot;boolean19&quot;: true,&#xd;
    &quot;boolean20&quot;: false,&#xd;
    &quot;subObject&quot;: {&#xd;
        &quot;string1&quot;: &quot;test&quot;,&#xd;
        &quot;string2&quot;: &quot;test&quot;,&#xd;
        &quot;string3&quot;: &quot;test&quot;,&#xd;
        &quot;string4&quot;: &quot;test&quot;,&#xd;
        &quot;string5&quot;: &quot;test&quot;,&#xd;
        &quot;string6&quot;: &quot;test&quot;,&#xd;
        &quot;string7&quot;: &quot;test&quot;,&#xd;
        &quot;string8&quot;: &quot;test&quot;,&#xd;
        &quot;string9&quot;: &quot;test&quot;,&#xd;
        &quot;string10&quot;: &quot;test&quot;,&#xd;
        &quot;string11&quot;: &quot;test&quot;,&#xd;
        &quot;string12&quot;: &quot;test&quot;,&#xd;
        &quot;string13&quot;: &quot;test&quot;,&#xd;
        &quot;string14&quot;: &quot;test&quot;,&#xd;
        &quot;string15&quot;: &quot;test&quot;,&#xd;
        &quot;string16&quot;: &quot;test&quot;,&#xd;
        &quot;string17&quot;: &quot;test&quot;,&#xd;
        &quot;string18&quot;: &quot;test&quot;,&#xd;
        &quot;string19&quot;: &quot;test&quot;,&#xd;
        &quot;string20&quot;: &quot;test&quot;,&#xd;
        &quot;int1&quot;: 10,&#xd;
        &quot;int2&quot;: 10,&#xd;
        &quot;int3&quot;: 10,&#xd;
        &quot;int4&quot;: 10,&#xd;
        &quot;int5&quot;: 10,&#xd;
        &quot;int6&quot;: 10,&#xd;
        &quot;int7&quot;: 10,&#xd;
        &quot;int8&quot;: 10,&#xd;
        &quot;int9&quot;: 10,&#xd;
        &quot;int10&quot;: 10,&#xd;
        &quot;int11&quot;: 10,&#xd;
        &quot;int12&quot;: 10,&#xd;
        &quot;int13&quot;: 10,&#xd;
        &quot;int14&quot;: 10,&#xd;
        &quot;int15&quot;: 10,&#xd;
        &quot;int16&quot;: 10,&#xd;
        &quot;int17&quot;: 10,&#xd;
        &quot;int18&quot;: 10,&#xd;
        &quot;int19&quot;: 10,&#xd;
        &quot;int20&quot;: 10,&#xd;
        &quot;boolean1&quot;: true,&#xd;
        &quot;boolean2&quot;: false,&#xd;
        &quot;boolean3&quot;: true,&#xd;
        &quot;boolean4&quot;: false,&#xd;
        &quot;boolean5&quot;: true,&#xd;
        &quot;boolean6&quot;: false,&#xd;
        &quot;boolean7&quot;: true,&#xd;
        &quot;boolean8&quot;: false,&#xd;
        &quot;boolean9&quot;: true,&#xd;
        &quot;boolean10&quot;: false,&#xd;
        &quot;boolean11&quot;: true,&#xd;
        &quot;boolean12&quot;: false,&#xd;
        &quot;boolean13&quot;: true,&#xd;
        &quot;boolean14&quot;: false,&#xd;
        &quot;boolean15&quot;: true,&#xd;
        &quot;boolean16&quot;: false,&#xd;
        &quot;boolean17&quot;: true,&#xd;
        &quot;boolean18&quot;: false,&#xd;
        &quot;boolean19&quot;: true,&#xd;
        &quot;boolean20&quot;: false&#xd;
    }&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/test/test</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>